app/views/main/index.html.erb

SELECT "goals".* FROM "goals"
---
        goalName = $(".goal-name");
        goalName.click(function() {
            divArr = $(".goal-block");
            divArr.sort(function(a, b) {
                return $(a).find("div.goal-name-value").text() > $(b).find("div.goal-name-value").text() ? 1: -1;
            });
            $(".goal-container").append(divArr);
        });

SELECT "goals".* FROM "goals"
---
        dueDate = $(".due-date");
        dueDate.click(function() {
            divArr = $(".goal-block");
            divArr.sort(function(a, b) {
                    return $(a).find("div.due-date-value").text() > $(b).find("div.due-date-value").text() ? 1: -1;
            });
            $(".goal-container").append(divArr);
        });