app/views/main/show.html.erb

UPDATE "goals" SET "updated_at" = ?, "complete" = ? WHERE "goals"."id" = ?  [["updated_at", "2022-08-08 09:29:42.237402"], ["complete", 0], ["id", 24]]
---
            isComplete = false;
            <%= @goal.toggle!(:complete) %>