app/controllers/main_controller.rb

SELECT "goals".* FROM "goals"
SELECT COUNT(*) FROM "goals"
---
    def index
        @goals = Goal.all
        @count = Goal.count

SELECT "goals".* FROM "goals" WHERE "goals"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
---
    def show
        @goal = Goal.find(params[:id])

SELECT "goals".* FROM "goals" WHERE "goals"."id" = ? LIMIT ?  [["id", 17], ["LIMIT", 1]]
---
    def edit
        @goal = Goal.find(params[:id])

SELECT "goals".* FROM "goals" WHERE "goals"."id" = ? LIMIT ?  [["id", 22], ["LIMIT", 1]]
UPDATE "goals" SET "description" = ?, "priority" = ?, "date" = ?, "updated_at" = ? WHERE "goals"."id" = ?  [["description", "q"], ["priority", "High"], ["date", "2022-08-26"], ["updated_at", "2022-08-08 12:10:59.179926"], ["id", 40]]
---
    def update
        @goal = Goal.find(params[:id])

        if (@goal.update(goal_params))

SELECT "goals".* FROM "goals" WHERE "goals"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
DELETE FROM "goals" WHERE "goals"."id" = ?  [["id", 15]]
---
    def destroy
        @goal = Goal.find(params[:id])
        @goal.destroy

INSERT INTO "goals" ("title", "description", "priority", "date", "created_at", "updated_at", "complete") VALUES (?, ?, ?, ?, ?, ?, ?)  [["title", "Тест1"], ["description", "x"], ["priority", "high"], ["date", "2022-08-08"], ["created_at", "2022-08-08 07:24:03.177035"], ["updated_at", "2022-08-08 07:24:03.177035"], ["complete", 0]]
---
    def create
        @goal = Goal.new(goal_params)

        if (@goal.save)